---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionApprovalStatus
source: html/e413421b-e8a5-2f39-637c-5c9f17cba9ff.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionApprovalStatus Property

"Approval Status"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralConnectionApprovalStatus { get; }
```